MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM4MMFWAFG/mcu.h
#define TSB_CANAMB0_BASE           (PERI_BASE  + 0x0005000UL)
#define TSB_CANAMB1_BASE           (PERI_BASE  + 0x0005020UL)
#define TSB_CANAMB2_BASE           (PERI_BASE  + 0x0005040UL)
#define TSB_CANAMB3_BASE           (PERI_BASE  + 0x0005060UL)
#define TSB_CANAMB4_BASE           (PERI_BASE  + 0x0005080UL)
#define TSB_CANAMB5_BASE           (PERI_BASE  + 0x00050A0UL)
#define TSB_CANAMB6_BASE           (PERI_BASE  + 0x00050C0UL)
#define TSB_CANAMB7_BASE           (PERI_BASE  + 0x00050E0UL)
#define TSB_CANAMB8_BASE           (PERI_BASE  + 0x0005100UL)
#define TSB_CANAMB9_BASE           (PERI_BASE  + 0x0005120UL)
#define TSB_CANAMB10_BASE          (PERI_BASE  + 0x0005140UL)
#define TSB_CANAMB11_BASE          (PERI_BASE  + 0x0005160UL)
#define TSB_CANAMB12_BASE          (PERI_BASE  + 0x0005180UL)
#define TSB_CANAMB13_BASE          (PERI_BASE  + 0x00051A0UL)
#define TSB_CANAMB14_BASE          (PERI_BASE  + 0x00051C0UL)
#define TSB_CANAMB15_BASE          (PERI_BASE  + 0x00051E0UL)
#define TSB_CANAMB16_BASE          (PERI_BASE  + 0x0005200UL)
#define TSB_CANAMB17_BASE          (PERI_BASE  + 0x0005220UL)
#define TSB_CANAMB18_BASE          (PERI_BASE  + 0x0005240UL)
#define TSB_CANAMB19_BASE          (PERI_BASE  + 0x0005260UL)
#define TSB_CANAMB20_BASE          (PERI_BASE  + 0x0005280UL)
#define TSB_CANAMB21_BASE          (PERI_BASE  + 0x00052A0UL)
#define TSB_CANAMB22_BASE          (PERI_BASE  + 0x00052C0UL)
#define TSB_CANAMB23_BASE          (PERI_BASE  + 0x00052E0UL)
#define TSB_CANAMB24_BASE          (PERI_BASE  + 0x0005300UL)
#define TSB_CANAMB25_BASE          (PERI_BASE  + 0x0005320UL)
#define TSB_CANAMB26_BASE          (PERI_BASE  + 0x0005340UL)
#define TSB_CANAMB27_BASE          (PERI_BASE  + 0x0005360UL)
#define TSB_CANAMB28_BASE          (PERI_BASE  + 0x0005380UL)
#define TSB_CANAMB29_BASE          (PERI_BASE  + 0x00053A0UL)
#define TSB_CANAMB30_BASE          (PERI_BASE  + 0x00053C0UL)
#define TSB_CANAMB31_BASE          (PERI_BASE  + 0x00053E0UL)
#define TSB_CANA_BASE              (PERI_BASE  + 0x0005400UL)
#define TSB_IA_BASE                (PERI_BASE  + 0x003E000UL)
#define TSB_RLM_BASE               (PERI_BASE  + 0x003E400UL)
#define TSB_LVD_BASE               (PERI_BASE  + 0x003EC00UL)
#define TSB_RPAR0_BASE             (PERI_BASE  + 0x0043000UL)
#define TSB_RPAR1_BASE             (PERI_BASE  + 0x00A3000UL)
#define TSB_CRC_BASE               (PERI_BASE  + 0x0043100UL)
#define TSB_CG_BASE                (PERI_BASE  + 0x0083000UL)
#define TSB_IB_BASE                (PERI_BASE  + 0x0083200UL)
#define TSB_IMN_BASE               (PERI_BASE  + 0x0083300UL)
#define TSB_DNFA_BASE              (PERI_BASE  + 0x00A0200UL)
#define TSB_DNFB_BASE              (PERI_BASE  + 0x00A0300UL)
#define TSB_DNFC_BASE              (PERI_BASE  + 0x00A0800UL)
#define TSB_TSEL0_BASE             (PERI_BASE  + 0x00A0400UL)
#define TSB_SIWD0_BASE             (PERI_BASE  + 0x00A0600UL)
#define TSB_DMAA_BASE              (PERI_BASE  + 0x00A4000UL)
#define TSB_ADA_BASE               (PERI_BASE  + 0x00BA000UL)
#define TSB_ADB_BASE               (PERI_BASE  + 0x00BA400UL)
#define TSB_ADC_BASE               (PERI_BASE  + 0x00BA800UL)
#define TSB_AMP_BASE               (PERI_BASE  + 0x00BD000UL)
#define TSB_T32A0_BASE             (PERI_BASE  + 0x00C1000UL)
#define TSB_T32A1_BASE             (PERI_BASE  + 0x00C1400UL)
#define TSB_T32A2_BASE             (PERI_BASE  + 0x00C1800UL)
#define TSB_T32A3_BASE             (PERI_BASE  + 0x00C1C00UL)
#define TSB_T32A4_BASE             (PERI_BASE  + 0x00C2000UL)
#define TSB_T32A5_BASE             (PERI_BASE  + 0x00C2400UL)
#define TSB_TSPI0_BASE             (PERI_BASE  + 0x00CA000UL)
#define TSB_TSPI1_BASE             (PERI_BASE  + 0x00CA400UL)
#define TSB_UART0_BASE             (PERI_BASE  + 0x00CE000UL)
#define TSB_UART1_BASE             (PERI_BASE  + 0x00CE400UL)
#define TSB_UART2_BASE             (PERI_BASE  + 0x00CE800UL)
#define TSB_UART3_BASE             (PERI_BASE  + 0x00CEC00UL)
#define TSB_I2C0_BASE              (PERI_BASE  + 0x00D1000UL)
#define TSB_I2C1_BASE              (PERI_BASE  + 0x00D2000UL)
#define TSB_EI2C0_BASE             (PERI_BASE  + 0x00D8000UL)
#define TSB_EI2C1_BASE             (PERI_BASE  + 0x00D9000UL)
#define TSB_PA_BASE                (PERI_BASE  + 0x00E0000UL)
#define TSB_PB_BASE                (PERI_BASE  + 0x00E0100UL)
#define TSB_PC_BASE                (PERI_BASE  + 0x00E0200UL)
#define TSB_PE_BASE                (PERI_BASE  + 0x00E0400UL)
#define TSB_PF_BASE                (PERI_BASE  + 0x00E0500UL)
#define TSB_PG_BASE                (PERI_BASE  + 0x00E0600UL)
#define TSB_PH_BASE                (PERI_BASE  + 0x00E0700UL)
#define TSB_PJ_BASE                (PERI_BASE  + 0x00E0800UL)
#define TSB_PK_BASE                (PERI_BASE  + 0x00E0900UL)
#define TSB_PL_BASE                (PERI_BASE  + 0x00E0A00UL)
#define TSB_PN_BASE                (PERI_BASE  + 0x00E0C00UL)
#define TSB_PU_BASE                (PERI_BASE  + 0x00E1000UL)
#define TSB_TRM_BASE               (PERI_BASE  + 0x00E3100UL)
#define TSB_OFD_BASE               (PERI_BASE  + 0x00E4000UL)
#define TSB_PMD0_BASE              (PERI_BASE  + 0x00E9000UL)
#define TSB_PMD1_BASE              (PERI_BASE  + 0x00E9400UL)
#define TSB_PMD2_BASE              (PERI_BASE  + 0x00E9800UL)
#define TSB_EN0_BASE               (PERI_BASE  + 0x00EA000UL)
#define TSB_EN1_BASE               (PERI_BASE  + 0x00EA400UL)
#define TSB_EN2_BASE               (PERI_BASE  + 0x00EA800UL)
#define TSB_VE0_BASE               (PERI_BASE  + 0x00EB000UL)
#define TSB_FC_BASE                (PERI_BASE  + 0x1DFF0000UL)


/* Peripheral declaration */
#define TSB_CANAMB0                (( TSB_CANAMB_TypeDef *)TSB_CANAMB0_BASE)
#define TSB_CANAMB1                (( TSB_CANAMB_TypeDef *)TSB_CANAMB1_BASE)
#define TSB_CANAMB2                (( TSB_CANAMB_TypeDef *)TSB_CANAMB2_BASE)
#define TSB_CANAMB3                (( TSB_CANAMB_TypeDef *)TSB_CANAMB3_BASE)
#define TSB_CANAMB4                (( TSB_CANAMB_TypeDef *)TSB_CANAMB4_BASE)
#define TSB_CANAMB5                (( TSB_CANAMB_TypeDef *)TSB_CANAMB5_BASE)
#define TSB_CANAMB6                (( TSB_CANAMB_TypeDef *)TSB_CANAMB6_BASE)
#define TSB_CANAMB7                (( TSB_CANAMB_TypeDef *)TSB_CANAMB7_BASE)
#define TSB_CANAMB8                (( TSB_CANAMB_TypeDef *)TSB_CANAMB8_BASE)
#define TSB_CANAMB9                (( TSB_CANAMB_TypeDef *)TSB_CANAMB9_BASE)
#define TSB_CANAMB10               (( TSB_CANAMB_TypeDef *)TSB_CANAMB10_BASE)
#define TSB_CANAMB11               (( TSB_CANAMB_TypeDef *)TSB_CANAMB11_BASE)
#define TSB_CANAMB12               (( TSB_CANAMB_TypeDef *)TSB_CANAMB12_BASE)
#define TSB_CANAMB13               (( TSB_CANAMB_TypeDef *)TSB_CANAMB13_BASE)
#define TSB_CANAMB14               (( TSB_CANAMB_TypeDef *)TSB_CANAMB14_BASE)
#define TSB_CANAMB15               (( TSB_CANAMB_TypeDef *)TSB_CANAMB15_BASE)
#define TSB_CANAMB16               (( TSB_CANAMB_TypeDef *)TSB_CANAMB16_BASE)
#define TSB_CANAMB17               (( TSB_CANAMB_TypeDef *)TSB_CANAMB17_BASE)
#define TSB_CANAMB18               (( TSB_CANAMB_TypeDef *)TSB_CANAMB18_BASE)
#define TSB_CANAMB19               (( TSB_CANAMB_TypeDef *)TSB_CANAMB19_BASE)
#define TSB_CANAMB20               (( TSB_CANAMB_TypeDef *)TSB_CANAMB20_BASE)
#define TSB_CANAMB21               (( TSB_CANAMB_TypeDef *)TSB_CANAMB21_BASE)
#define TSB_CANAMB22               (( TSB_CANAMB_TypeDef *)TSB_CANAMB22_BASE)
#define TSB_CANAMB23               (( TSB_CANAMB_TypeDef *)TSB_CANAMB23_BASE)
#define TSB_CANAMB24               (( TSB_CANAMB_TypeDef *)TSB_CANAMB24_BASE)
#define TSB_CANAMB25               (( TSB_CANAMB_TypeDef *)TSB_CANAMB25_BASE)
#define TSB_CANAMB26               (( TSB_CANAMB_TypeDef *)TSB_CANAMB26_BASE)
#define TSB_CANAMB27               (( TSB_CANAMB_TypeDef *)TSB_CANAMB27_BASE)
#define TSB_CANAMB28               (( TSB_CANAMB_TypeDef *)TSB_CANAMB28_BASE)
#define TSB_CANAMB29               (( TSB_CANAMB_TypeDef *)TSB_CANAMB29_BASE)
#define TSB_CANAMB30               (( TSB_CANAMB_TypeDef *)TSB_CANAMB30_BASE)
#define TSB_CANAMB31               (( TSB_CANAMB_TypeDef *)TSB_CANAMB31_BASE)
#define TSB_CANA                   ((    TSB_CAN_TypeDef *)  TSB_CANA_BASE)
#define TSB_IA                     ((     TSB_IA_TypeDef *)    TSB_IA_BASE)
#define TSB_RLM                    ((    TSB_RLM_TypeDef *)   TSB_RLM_BASE)
#define TSB_LVD                    ((    TSB_LVD_TypeDef *)   TSB_LVD_BASE)
#define TSB_RPAR0                  ((   TSB_RPAR_TypeDef *) TSB_RPAR0_BASE)
#define TSB_RPAR1                  ((   TSB_RPAR_TypeDef *) TSB_RPAR1_BASE)
#define TSB_CRC                    ((    TSB_CRC_TypeDef *)   TSB_CRC_BASE)
#define TSB_CG                     ((     TSB_CG_TypeDef *)    TSB_CG_BASE)
#define TSB_IB                     ((     TSB_IB_TypeDef *)    TSB_IB_BASE)
#define TSB_IMN                    ((    TSB_IMN_TypeDef *)   TSB_IMN_BASE)
#define TSB_DNFA                   ((    TSB_DNF_TypeDef *)  TSB_DNFA_BASE)
#define TSB_DNFB                   ((    TSB_DNF_TypeDef *)  TSB_DNFB_BASE)
#define TSB_DNFC                   ((    TSB_DNF_TypeDef *)  TSB_DNFC_BASE)
#define TSB_TSEL0                  ((   TSB_TSEL_TypeDef *) TSB_TSEL0_BASE)
#define TSB_SIWD0                  ((   TSB_SIWD_TypeDef *) TSB_SIWD0_BASE)
#define TSB_DMAA                   ((    TSB_DMA_TypeDef *)  TSB_DMAA_BASE)
#define TSB_ADA                    ((     TSB_AD_TypeDef *)   TSB_ADA_BASE)
#define TSB_ADB                    ((     TSB_AD_TypeDef *)   TSB_ADB_BASE)
#define TSB_ADC                    ((     TSB_AD_TypeDef *)   TSB_ADC_BASE)
#define TSB_AMP                    ((    TSB_AMP_TypeDef *)   TSB_AMP_BASE)
#define TSB_T32A0                  ((   TSB_T32A_TypeDef *) TSB_T32A0_BASE)
#define TSB_T32A1                  ((   TSB_T32A_TypeDef *) TSB_T32A1_BASE)
#define TSB_T32A2                  ((   TSB_T32A_TypeDef *) TSB_T32A2_BASE)
#define TSB_T32A3                  ((   TSB_T32A_TypeDef *) TSB_T32A3_BASE)
#define TSB_T32A4                  ((   TSB_T32A_TypeDef *) TSB_T32A4_BASE)
#define TSB_T32A5                  ((   TSB_T32A_TypeDef *) TSB_T32A5_BASE)
#define TSB_TSPI0                  ((   TSB_TSPI_TypeDef *) TSB_TSPI0_BASE)
#define TSB_TSPI1                  ((   TSB_TSPI_TypeDef *) TSB_TSPI1_BASE)
#define TSB_UART0                  ((   TSB_UART_TypeDef *) TSB_UART0_BASE)
#define TSB_UART1                  ((   TSB_UART_TypeDef *) TSB_UART1_BASE)
#define TSB_UART2                  ((   TSB_UART_TypeDef *) TSB_UART2_BASE)
#define TSB_UART3                  ((   TSB_UART_TypeDef *) TSB_UART3_BASE)
#define TSB_I2C0                   ((    TSB_I2C_TypeDef *)  TSB_I2C0_BASE)
#define TSB_I2C1                   ((    TSB_I2C_TypeDef *)  TSB_I2C1_BASE)
#define TSB_EI2C0                  ((   TSB_EI2C_TypeDef *) TSB_EI2C0_BASE)
#define TSB_EI2C1                  ((   TSB_EI2C_TypeDef *) TSB_EI2C1_BASE)
#define TSB_PA                     ((     TSB_PA_TypeDef *)    TSB_PA_BASE)
#define TSB_PB                     ((     TSB_PB_TypeDef *)    TSB_PB_BASE)
#define TSB_PC                     ((     TSB_PC_TypeDef *)    TSB_PC_BASE)
#define TSB_PE                     ((     TSB_PE_TypeDef *)    TSB_PE_BASE)
#define TSB_PF                     ((     TSB_PF_TypeDef *)    TSB_PF_BASE)
#define TSB_PG                     ((     TSB_PG_TypeDef *)    TSB_PG_BASE)
#define TSB_PH                     ((     TSB_PH_TypeDef *)    TSB_PH_BASE)
#define TSB_PJ                     ((     TSB_PJ_TypeDef *)    TSB_PJ_BASE)
#define TSB_PK                     ((     TSB_PK_TypeDef *)    TSB_PK_BASE)
#define TSB_PL                     ((     TSB_PL_TypeDef *)    TSB_PL_BASE)
#define TSB_PN                     ((     TSB_PN_TypeDef *)    TSB_PN_BASE)
#define TSB_PU                     ((     TSB_PU_TypeDef *)    TSB_PU_BASE)
#define TSB_TRM                    ((    TSB_TRM_TypeDef *)   TSB_TRM_BASE)
#define TSB_OFD                    ((    TSB_OFD_TypeDef *)   TSB_OFD_BASE)
#define TSB_PMD0                   ((    TSB_PMD_TypeDef *)  TSB_PMD0_BASE)
#define TSB_PMD1                   ((    TSB_PMD_TypeDef *)  TSB_PMD1_BASE)
#define TSB_PMD2                   ((    TSB_PMD_TypeDef *)  TSB_PMD2_BASE)
#define TSB_EN0                    ((     TSB_EN_TypeDef *)   TSB_EN0_BASE)
#define TSB_EN1                    ((     TSB_EN_TypeDef *)   TSB_EN1_BASE)
#define TSB_EN2                    ((     TSB_EN_TypeDef *)   TSB_EN2_BASE)
#define TSB_VE0                    ((     TSB_VE_TypeDef *)   TSB_VE0_BASE)
#define TSB_FC                     ((     TSB_FC_TypeDef *)    TSB_FC_BASE)


/* Bit-Band for Device Specific Peripheral Registers */
#define BITBAND_OFFSET (0x02000000UL)
#define BITBAND_PERI_BASE (PERI_BASE + BITBAND_OFFSET)
#define BITBAND_PERI(addr, bitnum) (BITBAND_PERI_BASE + (((uint32_t)(addr) - PERI_BASE) << 5) + ((uint32_t)(bitnum) << 2))



