MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM4MMFWAFG/mcu.h
#define TSB_ADC_CR0_CNT                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CR0,0)))
#define TSB_ADC_CR0_SGL                           (*((__O  uint32_t *)BITBAND_PERI(&TSB_ADC->CR0,1)))
#define TSB_ADC_CR0_ADEN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CR0,7)))
#define TSB_ADC_CR1_TRGEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CR1,0)))
#define TSB_ADC_CR1_TRGDMEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CR1,4)))
#define TSB_ADC_CR1_SGLDMEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CR1,5)))
#define TSB_ADC_CR1_CNTDMEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CR1,6)))
#define TSB_ADC_ST_PMDF                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->ST,0)))
#define TSB_ADC_ST_TRGF                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->ST,1)))
#define TSB_ADC_ST_SNGF                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->ST,2)))
#define TSB_ADC_ST_CNTF                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->ST,3)))
#define TSB_ADC_ST_ADBF                           (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->ST,7)))
#define TSB_ADC_MOD0_DACON                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->MOD0,0)))
#define TSB_ADC_MOD0_RCUT                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->MOD0,1)))
#define TSB_ADC_CMPEN_CMP0EN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CMPEN,0)))
#define TSB_ADC_CMPEN_CMP1EN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CMPEN,1)))
#define TSB_ADC_CMPCR0_ADBIG0                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CMPCR0,5)))
#define TSB_ADC_CMPCR0_CMPCND0                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CMPCR0,6)))
#define TSB_ADC_CMPCR1_ADBIG1                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CMPCR1,5)))
#define TSB_ADC_CMPCR1_CMPCND1                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->CMPCR1,6)))
#define TSB_ADC_PSEL0_PENS0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSEL0,7)))
#define TSB_ADC_PSEL1_PENS1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSEL1,7)))
#define TSB_ADC_PSEL2_PENS2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSEL2,7)))
#define TSB_ADC_PSEL3_PENS3                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSEL3,7)))
#define TSB_ADC_PSEL4_PENS4                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSEL4,7)))
#define TSB_ADC_PSEL5_PENS5                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSEL5,7)))
#define TSB_ADC_PSEL6_PENS6                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSEL6,7)))
#define TSB_ADC_PSEL7_PENS7                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSEL7,7)))
#define TSB_ADC_PSEL8_PENS8                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSEL8,7)))
#define TSB_ADC_PSEL9_PENS9                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSEL9,7)))
#define TSB_ADC_PSEL10_PENS10                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSEL10,7)))
#define TSB_ADC_PSEL11_PENS11                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSEL11,7)))
#define TSB_ADC_PSET0_ENSP00                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET0,7)))
#define TSB_ADC_PSET0_ENSP01                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET0,15)))
#define TSB_ADC_PSET0_ENSP02                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET0,23)))
#define TSB_ADC_PSET0_ENSP03                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET0,31)))
#define TSB_ADC_PSET1_ENSP10                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET1,7)))
#define TSB_ADC_PSET1_ENSP11                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET1,15)))
#define TSB_ADC_PSET1_ENSP12                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET1,23)))
#define TSB_ADC_PSET1_ENSP13                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET1,31)))
#define TSB_ADC_PSET2_ENSP20                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET2,7)))
#define TSB_ADC_PSET2_ENSP21                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET2,15)))
#define TSB_ADC_PSET2_ENSP22                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET2,23)))
#define TSB_ADC_PSET2_ENSP23                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET2,31)))
#define TSB_ADC_PSET3_ENSP30                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET3,7)))
#define TSB_ADC_PSET3_ENSP31                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET3,15)))
#define TSB_ADC_PSET3_ENSP32                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET3,23)))
#define TSB_ADC_PSET3_ENSP33                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET3,31)))
#define TSB_ADC_PSET4_ENSP40                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET4,7)))
#define TSB_ADC_PSET4_ENSP41                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET4,15)))
#define TSB_ADC_PSET4_ENSP42                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET4,23)))
#define TSB_ADC_PSET4_ENSP43                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET4,31)))
#define TSB_ADC_PSET5_ENSP50                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET5,7)))
#define TSB_ADC_PSET5_ENSP51                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET5,15)))
#define TSB_ADC_PSET5_ENSP52                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET5,23)))
#define TSB_ADC_PSET5_ENSP53                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET5,31)))
#define TSB_ADC_PSET6_ENSP60                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET6,7)))
#define TSB_ADC_PSET6_ENSP61                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET6,15)))
#define TSB_ADC_PSET6_ENSP62                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET6,23)))
#define TSB_ADC_PSET6_ENSP63                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET6,31)))
#define TSB_ADC_PSET7_ENSP70                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET7,7)))
#define TSB_ADC_PSET7_ENSP71                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET7,15)))
#define TSB_ADC_PSET7_ENSP72                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET7,23)))
#define TSB_ADC_PSET7_ENSP73                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->PSET7,31)))
#define TSB_ADC_TSET0_ENINT0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET0,7)))
#define TSB_ADC_TSET1_ENINT1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET1,7)))
#define TSB_ADC_TSET2_ENINT2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET2,7)))
#define TSB_ADC_TSET3_ENINT3                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET3,7)))
#define TSB_ADC_TSET4_ENINT4                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET4,7)))
#define TSB_ADC_TSET5_ENINT5                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET5,7)))
#define TSB_ADC_TSET6_ENINT6                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET6,7)))
#define TSB_ADC_TSET7_ENINT7                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET7,7)))
#define TSB_ADC_TSET8_ENINT8                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET8,7)))
#define TSB_ADC_TSET9_ENINT9                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET9,7)))
#define TSB_ADC_TSET10_ENINT10                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET10,7)))
#define TSB_ADC_TSET11_ENINT11                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET11,7)))
#define TSB_ADC_TSET12_ENINT12                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET12,7)))
#define TSB_ADC_TSET13_ENINT13                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET13,7)))
#define TSB_ADC_TSET14_ENINT14                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET14,7)))
#define TSB_ADC_TSET15_ENINT15                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET15,7)))
#define TSB_ADC_TSET16_ENINT16                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET16,7)))
#define TSB_ADC_TSET17_ENINT17                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET17,7)))
#define TSB_ADC_TSET18_ENINT18                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET18,7)))
#define TSB_ADC_TSET19_ENINT19                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET19,7)))
#define TSB_ADC_TSET20_ENINT20                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET20,7)))
#define TSB_ADC_TSET21_ENINT21                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET21,7)))
#define TSB_ADC_TSET22_ENINT22                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET22,7)))
#define TSB_ADC_TSET23_ENINT23                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_ADC->TSET23,7)))
#define TSB_ADC_REG0_ADRF0                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG0,0)))
#define TSB_ADC_REG0_ADOVRF0                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG0,1)))
#define TSB_ADC_REG0_ADRF_M0                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG0,28)))
#define TSB_ADC_REG0_ADOVRF_M0                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG0,29)))
#define TSB_ADC_REG1_ADRF1                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG1,0)))
#define TSB_ADC_REG1_ADOVRF1                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG1,1)))
#define TSB_ADC_REG1_ADRF_M1                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG1,28)))
#define TSB_ADC_REG1_ADOVRF_M1                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG1,29)))
#define TSB_ADC_REG2_ADRF2                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG2,0)))
#define TSB_ADC_REG2_ADOVRF2                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG2,1)))
#define TSB_ADC_REG2_ADRF_M2                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG2,28)))
#define TSB_ADC_REG2_ADOVRF_M2                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG2,29)))
#define TSB_ADC_REG3_ADRF3                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG3,0)))
#define TSB_ADC_REG3_ADOVRF3                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG3,1)))
#define TSB_ADC_REG3_ADRF_M3                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG3,28)))
#define TSB_ADC_REG3_ADOVRF_M3                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG3,29)))
#define TSB_ADC_REG4_ADRF4                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG4,0)))
#define TSB_ADC_REG4_ADOVRF4                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG4,1)))
#define TSB_ADC_REG4_ADRF_M4                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG4,28)))
#define TSB_ADC_REG4_ADOVRF_M4                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG4,29)))
#define TSB_ADC_REG5_ADRF5                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG5,0)))
#define TSB_ADC_REG5_ADOVRF5                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG5,1)))
#define TSB_ADC_REG5_ADRF_M5                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG5,28)))
#define TSB_ADC_REG5_ADOVRF_M5                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG5,29)))
#define TSB_ADC_REG6_ADRF6                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG6,0)))
#define TSB_ADC_REG6_ADOVRF6                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG6,1)))
#define TSB_ADC_REG6_ADRF_M6                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG6,28)))
#define TSB_ADC_REG6_ADOVRF_M6                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG6,29)))
#define TSB_ADC_REG7_ADRF7                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG7,0)))
#define TSB_ADC_REG7_ADOVRF7                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG7,1)))
#define TSB_ADC_REG7_ADRF_M7                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG7,28)))
#define TSB_ADC_REG7_ADOVRF_M7                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG7,29)))
#define TSB_ADC_REG8_ADRF8                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG8,0)))
#define TSB_ADC_REG8_ADOVRF8                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG8,1)))
#define TSB_ADC_REG8_ADRF_M8                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG8,28)))
#define TSB_ADC_REG8_ADOVRF_M8                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG8,29)))
#define TSB_ADC_REG9_ADRF9                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG9,0)))
#define TSB_ADC_REG9_ADOVRF9                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG9,1)))
#define TSB_ADC_REG9_ADRF_M9                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG9,28)))
#define TSB_ADC_REG9_ADOVRF_M9                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG9,29)))
#define TSB_ADC_REG10_ADRF10                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG10,0)))
#define TSB_ADC_REG10_ADOVRF10                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG10,1)))
#define TSB_ADC_REG10_ADRF_M10                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG10,28)))
#define TSB_ADC_REG10_ADOVRF_M10                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG10,29)))
#define TSB_ADC_REG11_ADRF11                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG11,0)))
#define TSB_ADC_REG11_ADOVRF11                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG11,1)))
#define TSB_ADC_REG11_ADRF_M11                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG11,28)))
#define TSB_ADC_REG11_ADOVRF_M11                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG11,29)))
#define TSB_ADC_REG12_ADRF12                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG12,0)))
#define TSB_ADC_REG12_ADOVRF12                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG12,1)))
#define TSB_ADC_REG12_ADRF_M12                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG12,28)))
#define TSB_ADC_REG12_ADOVRF_M12                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG12,29)))
#define TSB_ADC_REG13_ADRF13                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG13,0)))
#define TSB_ADC_REG13_ADOVRF13                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG13,1)))
#define TSB_ADC_REG13_ADRF_M13                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG13,28)))
#define TSB_ADC_REG13_ADOVRF_M13                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG13,29)))
#define TSB_ADC_REG14_ADRF14                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG14,0)))
#define TSB_ADC_REG14_ADOVRF14                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG14,1)))
#define TSB_ADC_REG14_ADRF_M14                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG14,28)))
#define TSB_ADC_REG14_ADOVRF_M14                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG14,29)))
#define TSB_ADC_REG15_ADRF15                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG15,0)))
#define TSB_ADC_REG15_ADOVRF15                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG15,1)))
#define TSB_ADC_REG15_ADRF_M15                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG15,28)))
#define TSB_ADC_REG15_ADOVRF_M15                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG15,29)))
#define TSB_ADC_REG16_ADRF16                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG16,0)))
#define TSB_ADC_REG16_ADOVRF16                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG16,1)))
#define TSB_ADC_REG16_ADRF_M16                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG16,28)))
#define TSB_ADC_REG16_ADOVRF_M16                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG16,29)))
#define TSB_ADC_REG17_ADRF17                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG17,0)))
#define TSB_ADC_REG17_ADOVRF17                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG17,1)))
#define TSB_ADC_REG17_ADRF_M17                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG17,28)))
#define TSB_ADC_REG17_ADOVRF_M17                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG17,29)))
#define TSB_ADC_REG18_ADRF18                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG18,0)))
#define TSB_ADC_REG18_ADOVRF18                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG18,1)))
#define TSB_ADC_REG18_ADRF_M18                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG18,28)))
#define TSB_ADC_REG18_ADOVRF_M18                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG18,29)))
#define TSB_ADC_REG19_ADRF19                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG19,0)))
#define TSB_ADC_REG19_ADOVRF19                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG19,1)))
#define TSB_ADC_REG19_ADRF_M19                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG19,28)))
#define TSB_ADC_REG19_ADOVRF_M19                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG19,29)))
#define TSB_ADC_REG20_ADRF20                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG20,0)))
#define TSB_ADC_REG20_ADOVRF20                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG20,1)))
#define TSB_ADC_REG20_ADRF_M20                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG20,28)))
#define TSB_ADC_REG20_ADOVRF_M20                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG20,29)))
#define TSB_ADC_REG21_ADRF21                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG21,0)))
#define TSB_ADC_REG21_ADOVRF21                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG21,1)))
#define TSB_ADC_REG21_ADRF_M21                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG21,28)))
#define TSB_ADC_REG21_ADOVRF_M21                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG21,29)))
#define TSB_ADC_REG22_ADRF22                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG22,0)))
#define TSB_ADC_REG22_ADOVRF22                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG22,1)))
#define TSB_ADC_REG22_ADRF_M22                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG22,28)))
#define TSB_ADC_REG22_ADOVRF_M22                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG22,29)))
#define TSB_ADC_REG23_ADRF23                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG23,0)))
#define TSB_ADC_REG23_ADOVRF23                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG23,1)))
#define TSB_ADC_REG23_ADRF_M23                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG23,28)))
#define TSB_ADC_REG23_ADOVRF_M23                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_ADC->REG23,29)))


/* Gain Op-AMP (AMP) */
#define TSB_AMP_CTLA_AMPEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_AMP->CTLA,0)))
#define TSB_AMP_CTLB_AMPEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_AMP->CTLB,0)))
#define TSB_AMP_CTLC_AMPEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_AMP->CTLC,0)))


